[Killed] LogicalOperator
numbers.js/lib/numbers/basic.js:459:7
  * @param {Number} epsilon.
  */
 basic.numbersEqual = function (first, second, epsilon) {
-  if (typeof (first) !== 'number' || typeof (second) !== 'number' || typeof (epsilon) !== 'number') throw new Error("First and Second must be numbers.");
+  if (typeof first !== 'number' && typeof second !== 'number' || typeof (epsilon) !== 'number') throw new Error("First and Second must be numbers.");
   return (first - second) < epsilon && (first - second) > -epsilon;
 };
killedBy: numbers should be able to check equality of two floating point numbers only take numbers
statusReason: Missing expected exception.
