[Survived] UvaMutator
numbers.js/lib/numbers/basic.js:61:9
     }
     for (var i = 1, length = arr.length; i < length; i++) {
       if (typeof (arr[i]) === 'number') {
-        total -= arr[i];
+        total += arr[i];
       } else {
         throw new Error('All elements in array must be numbers');
